## Pandas를 참조합시다. (별칭 부여해서)

In [41]:
import pandas as pd

## 데이터를 읽어옵니다. 1
- TopRichestInWorld.csv

In [3]:
df = pd.read_csv('TopRichestInWorld.csv')
df

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

## 데이터를 읽어옵니다.2
- TopRichestInWorld.csv
- Industry 열만 사용하고
- 시리즈화 시키자.

In [9]:
df_industry = pd.read_csv('TopRichestInWorld.csv',usecols=['Industry']).squeeze()
df_industry

0                 Automotive
1                 Technology
2           Fashion & Retail
3                 Technology
4      Finance & Investments
               ...
96           Metals & Mining
97                    Energy
98                Healthcare
99             Manufacturing
100              Real Estate
Name: Industry, Length: 101, dtype: object

## 데이터를 읽어옵시다. 3
- TopRichestInWorld.csv
- col은 Age열 정보를 사용하고
- index는 Name열 정보를 사용하고
- 데이터를 시리즈화 시키자.

In [20]:
df_age = pd.read_csv('TopRichestInWorld.csv',
                     usecols=['Age','Name'],
                    index_col='Name').squeeze()
df_age

Name
Elon Musk                   50
Jeff Bezos                  58
Bernard Arnault & family    73
Bill Gates                  66
Warren Buffett              91
                            ..
Vladimir Potanin            61
Harold Hamm & family        76
Sun Piaoyang                63
Luo Liguo & family          66
Peter Woo                   75
Name: Age, Length: 101, dtype: int64

## 평균 나이가 어떻게 되나요? 1

In [26]:
df_age.mean()

67.11881188118812

## 평균 나이가 어떻게 되나요? 2
- 소수점 1자리까지 반올림 합니다.

In [44]:
df_age.mean().round(1)

AttributeError: 'float' object has no attribute 'round'

## 누가 가장 어리나요? 
- 코드로 그 사람 이름이 나오도록 해봅시다.
- 정렬을 사용하지 말고, 바로 지원하는 메소드를 생각해봅시다.
- 힌트 : 현재 index에는 이름이 저장되어있습니다. 때문에 나이가 어린 사람의 인덱스를 찾는다면 이름이 나오는 거겠죠?

In [54]:
df_age.sort_values(ascending=True).index[0]

'Sam Bankman-Fried'

## 누가 가장 나이가 많나요? 
- 코드로 그 사람 이름이 나오도록 해봅시다.

In [57]:
df_age.sort_values(ascending=False).index[0]

'Lee Shau Kee'

## 어린 순으로 정렬해봅시다.

In [65]:
df_age.sort_values(ascending=True)

Name
Sam Bankman-Fried          30
Mark Zuckerberg            37
Zhang Yiming               38
Yang Huiyan & family       40
Guillaume Pousaz           40
                           ..
Leonard Lauder             89
Rupert Murdoch & family    91
Warren Buffett             91
Li Ka-shing                93
Lee Shau Kee               94
Name: Age, Length: 101, dtype: int64

## 나이 분포가 어떻게 되나요? 1
- 5개로 구분하며
- 몇 명인지를 파악합시다.
- 비중이 높은 순으로 내림차순 합니다.

In [60]:
df_age.value_counts(bins=5)

(55.6, 68.4]      33
(68.4, 81.2]      27
(81.2, 94.0]      19
(42.8, 55.6]      17
(29.935, 42.8]     5
Name: Age, dtype: int64

## 나이 분포가 어떻게 되나요? 2
- 5개로 구분하며
- 퍼센트 비중으로 어떠한지 파악합시다.
- 비중이 높은 순으로 내림차순 합니다.

In [61]:
df_age.value_counts(bins=5, normalize=True)

(55.6, 68.4]      0.326733
(68.4, 81.2]      0.267327
(81.2, 94.0]      0.188119
(42.8, 55.6]      0.168317
(29.935, 42.8]    0.049505
Name: Age, dtype: float64

## 나이가 어린 순으로 새로운 csv를 저장합시다.
- 파일 이름은 TopYoungestAndRichiInWorld.csv

In [92]:
df_set=df_age.sort_values().to_csv('TopYoungestAndRichiInWorld.csv')

## 제대로 저장되었는지 데이터 확인해봅시다.

In [95]:
data = pd.read_csv('TopYoungestAndRichiInWorld.csv')
data

                        Name  Age
0          Sam Bankman-Fried   30
1            Mark Zuckerberg   37
2               Zhang Yiming   38
3       Yang Huiyan & family   40
4           Guillaume Pousaz   40
..                       ...  ...
96            Leonard Lauder   89
97   Rupert Murdoch & family   91
98            Warren Buffett   91
99               Li Ka-shing   93
100             Lee Shau Kee   94

[101 rows x 2 columns]